In [1]:
import pandas as pd

In [2]:
Work = pd.read_csv(".//workers.data", sep=",", usecols=[0, 9, 12, 13, 14],
                    names = ['Age', 'Sexe', 'Heures/Sem', 'Pays', 'Salaire'])

In [3]:
Work.head(3)

   Age   Sexe  Heures/Sem            Pays Salaire
0   39   Male          40   United-States   <=50K
1   50   Male          13   United-States   <=50K
2   38   Male          40   United-States   <=50K

In [4]:
Work.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 32561 entries, 0 to 32560
Data columns (total 5 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Age         32561 non-null  int64
 1   Sexe        32561 non-null  object
 2   Heures/Sem  32561 non-null  int64
 3   Pays        32561 non-null  object
 4   Salaire     32561 non-null  object
dtypes: int64(2), object(3)
memory usage: 1.2+ MB

In [5]:
Work.index

RangeIndex(start=0, stop=32561, step=1)

In [6]:
Work.columns

Index(['Age', 'Sexe', 'Heures/Sem', 'Pays', 'Salaire'], dtype='object')

In [7]:
DFSample = Work.sample(10000)
print(DFSample.shape)

(10000, 5)

In [8]:
DFSample.head(5)

       Age     Sexe  Heures/Sem            Pays Salaire
25838   25     Male          45   United-States    >50K
29886   32     Male          40   United-States   <=50K
22333   42     Male          60   United-States   <=50K
375     20   Female          10   United-States   <=50K
13153   26   Female          16   United-States   <=50K

In [9]:
DFSample.sort_index(axis=0, inplace=True)

In [10]:
DFSample.head(3)

   Age     Sexe  Heures/Sem            Pays Salaire
0   39     Male          40   United-States   <=50K
8   31   Female          50   United-States    >50K
9   42     Male          40   United-States    >50K

In [11]:
DFSample.reset_index(drop=True, inplace=True)

In [12]:
DFSample.head(3)

   Age     Sexe  Heures/Sem            Pays Salaire
0   39     Male          40   United-States   <=50K
1   31   Female          50   United-States    >50K
2   42     Male          40   United-States    >50K

In [13]:
Work.index.name = 'Num'

In [14]:
Work.head(3)

     Age   Sexe  Heures/Sem            Pays Salaire
Num
0     39   Male          40   United-States   <=50K
1     50   Male          13   United-States   <=50K
2     38   Male          40   United-States   <=50K

In [15]:
Work[ ["Age", "Sexe"] ].loc[100]

Age        76
Sexe     Male
Name: 100, dtype: object

In [16]:
Pays = Work["Pays"].unique()

In [17]:
Pays

array([' United-States', ' Cuba', ' Jamaica', ' India', ' ?', ' Mexico',
       ' South', ' Puerto-Rico', ' Honduras', ' England', ' Canada',
       ' Germany', ' Iran', ' Philippines', ' Italy', ' Poland',
       ' Columbia', ' Cambodia', ' Thailand', ' Ecuador', ' Laos',
       ' Taiwan', ' Haiti', ' Portugal', ' Dominican-Republic',
       ' El-Salvador', ' France', ' Guatemala', ' China', ' Japan',
       ' Yugoslavia', ' Peru', ' Outlying-US(Guam-USVI-etc)', ' Scotland',
       ' Trinadad&Tobago', ' Greece', ' Nicaragua', ' Vietnam', ' Hong',
       ' Ireland', ' Hungary', ' Holand-Netherlands'], dtype=object)

In [18]:
Pays.sort()
Pays

array([' ?', ' Cambodia', ' Canada', ' China', ' Columbia', ' Cuba',
       ' Dominican-Republic', ' Ecuador', ' El-Salvador', ' England',
       ' France', ' Germany', ' Greece', ' Guatemala', ' Haiti',
       ' Holand-Netherlands', ' Honduras', ' Hong', ' Hungary', ' India',
       ' Iran', ' Ireland', ' Italy', ' Jamaica', ' Japan', ' Laos',
       ' Mexico', ' Nicaragua', ' Outlying-US(Guam-USVI-etc)', ' Peru',
       ' Philippines', ' Poland', ' Portugal', ' Puerto-Rico',
       ' Scotland', ' South', ' Taiwan', ' Thailand', ' Trinadad&Tobago',
       ' United-States', ' Vietnam', ' Yugoslavia'], dtype=object)

In [19]:
Inde = Work[ Work["Pays"] == " India" ]

In [20]:
Inde.head(3)

     Age     Sexe  Heures/Sem    Pays Salaire
Num
11    30     Male          40   India    >50K
892   28   Female          40   India   <=50K
968   48     Male          40   India    >50K

In [21]:
pd.crosstab(Inde["Sexe"], Inde["Salaire"])

Salaire   <=50K   >50K
Sexe
 Female       9      2
 Male        51     38

In [22]:
Inde[ Inde["Salaire"] == " >50K" ]["Heures/Sem"].mean()

46.475

In [23]:
Grp = Work.groupby("Pays")["Heures/Sem"]

In [24]:
GrpAgg = Grp.agg('mean')

In [25]:
GrpAgg.sort_values(ascending=False).head(5)

Pays
 Thailand      45.444444
 France        45.068966
 Yugoslavia    44.562500
 Greece        44.241379
 Iran          43.976744
Name: Heures/Sem, dtype: float64